import MaxWidthWrapper from "../../components/max-width-wrapper";
import WhatYouCanDo from "./sections/what-you-can-do";
import HeroLights from "../../components/svgs/hero-lights";
import Pricing from "./sections/pricing";
import Hero from "./sections/hero";
import HowPlatformWorks from "./sections/how-platform-works";
import CreateLanch from "./sections/create-lanch";
import EaseSpeed from "./sections/ease-speed";
import NewExperiance from "./sections/new-experiance";
import StartNew from "./sections/start-new";
import SiteFooter from "@/src/components/layout/site-footer";
import FadeIn from "@/src/components/animations/fade-in";

export default function Page() {
  return (
    <>
      <Hero />
      <HeroLights />
      <FadeIn>
        <WhatYouCanDo />
      </FadeIn>
      <FadeIn>
        <HowPlatformWorks />
      </FadeIn>
      <FadeIn>
        <CreateLanch />
      </FadeIn>
      <FadeIn>
        <EaseSpeed />
      </FadeIn>
      <FadeIn>
        <MaxWidthWrapper className="my-16 ">
          <div className="w-full min-h-[250px] h-fit  flex flex-col justify-center gap-y-8 pt-8  ">
            <h2 className="text-5xl font-bold text-center">
              قدرات جديدة، بتجربة مذهلة، في مكان
              <span className="text-[#FFB700] relative inline-block mx-10 ">
                <div className="absolute -top-20 bottom-0  -right-10 ">
                  <svg
                    width="200"
                    height="200"
                    viewBox="0 0 384 201"
                    fill="none"
                    xmlns="http://www.w3.org/2000/svg"
                  >
                    <path
                      d="M328.091 35.1354C331.804 37.1432 335.052 38.9001 338.301 40.6569C351.758 48.1861 364.056 57.7232 373.337 71.0248C386.099 88.8441 387.491 108.922 377.05 128.749C371.713 139.039 364.288 147.07 355.703 154.098C338.765 167.65 319.738 176.183 299.783 182.96C270.547 192.748 240.615 198.018 210.219 199.775C177.27 201.783 144.554 200.026 111.838 194.504C88.1703 190.74 64.735 184.716 42.692 173.674C34.1068 169.407 25.5217 163.886 18.0967 157.36C-1.16199 140.043 -5.33856 113.189 6.95913 89.346C12.992 77.5502 21.5771 67.7622 31.0904 59.229C53.8296 38.9001 80.0491 26.1004 107.893 16.8143C146.178 4.01457 185.16 -1.2559 225.069 0.249951C251.521 1.25385 277.972 4.01457 303.496 12.0458C311.153 14.3045 318.346 17.8182 325.771 20.8299C327.627 21.5828 329.251 22.8377 330.876 24.0926C335.052 27.6062 334.82 30.6179 330.179 33.8806C329.715 34.3825 329.019 34.6335 328.091 35.1354ZM214.396 12.7987C214.396 12.5477 214.396 12.2967 214.396 12.0458C213.003 12.0458 211.379 11.7948 209.987 11.7948C177.735 12.0458 145.946 17.0653 114.854 27.1043C87.9382 35.6374 62.1827 47.6842 40.1397 67.0092C31.3225 74.7895 23.2014 83.3226 17.4006 94.1145C6.7271 114.193 10.2076 136.027 26.9139 150.082C33.1787 155.352 40.1397 159.619 47.3327 163.133C66.8233 172.921 87.4742 178.191 108.357 182.207C138.521 187.979 168.917 189.485 199.313 188.732C235.046 187.728 270.315 181.705 304.192 169.156C320.202 163.133 335.516 155.854 349.206 145.062C357.559 138.286 364.752 130.255 369.393 119.965C374.497 108.42 374.962 96.6243 368.929 85.3304C366.608 81.0638 363.592 76.7973 360.576 73.2836C350.598 61.7388 338.533 53.7076 325.075 47.4332C308.368 39.653 291.198 33.8806 273.332 30.116C249.664 24.8455 225.765 22.3357 201.866 27.6062C200.706 27.8572 199.081 28.3591 198.153 27.8572C196.529 26.8533 194.441 25.5984 193.977 24.0926C193.513 22.5867 194.905 20.077 196.065 18.8221C197.457 17.5672 199.546 17.0653 201.402 16.5633C205.81 14.8065 209.987 13.8026 214.396 12.7987ZM288.646 20.8299C300.015 24.8455 311.153 28.6101 322.522 32.6257C312.081 25.3474 300.711 22.3357 288.646 20.8299Z"
                      fill="#FFB800"
                    />
                  </svg>
                </div>
                واحد
              </span>
            </h2>
            <p className="text-center my-4 text-xl max-w-5xl mt-8 mx-auto">
              كل ما تحتاجه لإنشاء وبناء دورات تدريبية وبرامج تعليمية، مع إمكانات
              تخصيص عالية، وأدوات تسيير المسارات التعليمية فائقة الجودة،
              بالإضافة إلى موقع إلكتروني ومجتمع رقمي خاص، في مكان واحد.
            </p>
            <div className="w-full h-[400px] rounded-xl border  border-[#FFB800] bg-[#F8FAE5]"></div>
          </div>
        </MaxWidthWrapper>
      </FadeIn>
      <FadeIn>
        <NewExperiance />
      </FadeIn>
      <FadeIn>
        <MaxWidthWrapper className="my-8">
          <div className="w-full min-h-[250px] h-fit  flex flex-col justify-center gap-y-8  pt-20 ">
            <h2 className="text-5xl font-bold text-center">
              حافظ على{" "}
              <span className="text-[#FFB700] relative mx-2 inline-block ">
                <div className="absolute    -left-3.5   ">
                  <svg
                    width="19"
                    height="55"
                    viewBox="0 0 19 55"
                    fill="none"
                    xmlns="http://www.w3.org/2000/svg"
                  >
                    <g clip-path="url(#clip0_358_955)">
                      <path
                        d="M8.10362 46.4324C8.38681 46.471 8.65769 46.5426 8.92329 46.6481L8.32609 46.3961C8.60892 46.5161 8.87003 46.6684 9.11606 46.8523L8.61009 46.4614C8.89537 46.6839 9.14521 46.9383 9.36688 47.2241L8.97597 46.7181C9.19483 47.011 9.37608 47.3236 9.52334 47.6583L9.27132 47.0611C9.42277 47.422 9.5288 47.7935 9.58735 48.1807L9.49805 47.5161C9.5454 47.8736 9.54982 48.2289 9.50507 48.587L9.59437 47.9224C9.54979 48.2266 9.47104 48.5185 9.3531 48.8026L9.60512 48.2054C9.49993 48.4426 9.37176 48.663 9.21724 48.8715L9.60815 48.3656C9.4385 48.5833 9.24778 48.7759 9.03254 48.9486L9.53851 48.5577C9.28199 48.7544 9.00589 48.9132 8.70888 49.0403L9.30608 48.7883C8.98008 48.9205 8.64453 49.0096 8.29669 49.0615L8.96129 48.9722C8.55876 49.0251 8.15683 49.026 7.75391 48.9765L8.41851 49.0658C8.04307 49.0132 7.68093 48.9185 7.32922 48.7768L7.92642 49.0288C7.60494 48.8923 7.30638 48.7212 7.02967 48.5077L7.53564 48.8987C7.32243 48.7269 7.13206 48.5365 6.96208 48.3218L7.35299 48.8278C7.18086 48.5996 7.04097 48.357 6.92931 48.0939L7.18133 48.6911C7.07411 48.4195 7.00295 48.1422 6.96391 47.8529L7.05321 48.5175C7.018 48.2022 7.02235 47.8899 7.06181 47.5752L6.97251 48.2398C7.0266 47.8689 7.12678 47.5131 7.26949 47.1666L7.01747 47.7638C7.16753 47.4174 7.35445 47.0947 7.58017 46.792L7.18926 47.298C7.41884 47.0015 7.67765 46.737 7.9722 46.5046L7.46623 46.8955C7.71922 46.704 7.98761 46.5437 8.27815 46.4158L7.68095 46.6678C7.95031 46.5564 8.22539 46.4784 8.51355 46.4342L7.84895 46.5235C7.98231 46.5064 8.11479 46.4963 8.24915 46.4929C8.90022 46.4765 9.55222 46.2254 10.0169 45.7607C10.4505 45.3271 10.777 44.6157 10.7491 43.9929C10.6897 42.6667 9.64972 41.4576 8.24915 41.4929C6.78078 41.53 5.53234 42.0842 4.40553 42.9937C3.44661 43.7676 2.82011 44.8509 2.38833 45.9863C1.95967 47.1136 1.92221 48.4441 2.22305 49.6067C2.57816 50.979 3.4449 52.0458 4.56463 52.8703C5.52543 53.5778 6.69983 53.8724 7.86675 53.9897C9.05612 54.1093 10.2257 53.8157 11.3008 53.3285C13.4605 52.3496 14.7915 49.8523 14.498 47.5161C14.3857 46.6214 14.1957 45.9229 13.825 45.0989C13.5608 44.5118 13.1731 43.9965 12.7567 43.5077C11.9494 42.5599 10.6758 41.7805 9.43281 41.611C8.73542 41.5159 8.14115 41.4916 7.50641 41.863C6.98783 42.1665 6.49326 42.7611 6.35751 43.3571C6.21175 43.9971 6.24329 44.7154 6.60953 45.2835C6.93501 45.7883 7.47858 46.3472 8.10362 46.4324Z"
                        fill="#FFB800"
                      />
                      <path
                        d="M10.3752 36.2444C8.76692 31.0697 7.63739 25.7179 6.6237 20.3999C6.34865 18.957 6.08974 17.5108 5.85391 16.0609C5.62446 14.6503 5.4492 13.4592 5.31713 12.3396C5.18287 11.2015 5.06953 10.059 5.02052 8.91366C5.00216 8.48473 4.99145 8.05517 4.99968 7.62585C5.00324 7.43995 5.01506 7.25465 5.02052 7.06892C5.03513 6.57188 5.12023 6.67863 5.00986 6.98937C5.05173 6.87149 5.02523 6.71182 5.08979 6.60263C5.32348 6.20741 4.89299 6.78992 4.97749 6.81177C4.97749 6.81177 5.94974 5.72283 5.94365 5.72747C6.34222 5.42376 6.52705 5.37443 7.11339 5.23853C7.65574 5.11283 8.3813 5.09358 9.13958 5.07203C10.6214 5.02992 11.8607 4.9455 12.7688 5.60414C12.7871 5.61744 13.2591 6.08293 13.4129 6.23294C13.5569 6.37334 13.6835 6.42147 13.5911 6.42151C13.458 6.42156 13.5692 6.27961 13.5783 6.41125C13.5892 6.56854 13.2555 5.82592 13.4962 6.23658C13.6717 6.53588 13.5239 6.60359 13.5118 6.13005C13.5325 6.93683 13.5512 7.71498 13.4725 8.52288C13.4499 8.75485 13.4222 8.98621 13.3941 9.21755C13.3484 9.59424 13.4563 8.79538 13.3977 9.1836C13.3813 9.29242 13.3665 9.40153 13.3488 9.51016C13.2476 10.1328 13.1415 10.754 13.0215 11.3733C12.4957 14.0874 11.8084 16.7706 11.0713 19.4341C9.50262 25.1026 7.7609 30.7874 5.55378 36.2443C5.04733 37.4965 6.10501 38.9913 7.29988 39.3196C8.72852 39.7122 9.86685 38.8303 10.3752 37.5735C12.4885 32.3485 14.1634 26.9131 15.6893 21.4921C16.5286 18.5105 17.313 15.5041 17.8895 12.4594C18.3066 10.2568 18.7635 7.92032 18.4512 5.67574C18.0076 2.4871 14.7525 0.46845 11.7676 0.1349C8.23427 -0.25995 4.15257 0.0822794 1.69124 2.92988C0.11275 4.75609 -0.0841702 6.6725 0.0248598 9.01347C0.16012 11.9175 0.60777 14.8165 1.08026 17.6815C2.18155 24.3594 3.54294 31.1036 5.55377 37.5736C6.50571 40.6365 11.334 39.3294 10.3752 36.2444Z"
                        fill="#FFB800"
                      />
                    </g>
                    <defs>
                      <clipPath id="clip0_358_955">
                        <rect width="18.5544" height="54.0164" fill="white" />
                      </clipPath>
                    </defs>
                  </svg>
                </div>
                آمان
              </span>{" "}
              محتواك.
            </h2>
            <p className="text-center my-4 text-xl max-w-5xl mt-8 mx-auto">
              لأننا نؤمن بأن خبراتك ومحتواك هو أثمن مواردك المعرفية، نوفر لك
              أدوات تتيح حماية المحتوى من الاستخدامات غير القانونية كالنسخ
              والسرقة وغيرها.
            </p>
            <div className="w-full h-[400px] border-[#FFB800] border   bg-[#F8FAE5] rounded-lg"></div>
          </div>
        </MaxWidthWrapper>
      </FadeIn>
      <FadeIn>
        <MaxWidthWrapper className="my-8">
          <div className="w-full min-h-[250px] h-fit  flex flex-col justify-center gap-y-8  ">
            <h2 className="text-5xl font-bold text-center">أهم المميزات</h2>
            <p className="text-center my-4 text-xl">
              إنشاء وتسويق وبيع الدورات التدريبية عبر الإنترنت، في مكان واحد.
            </p>
          </div>
          <div className="w-full h-[250px] grid grid-cols-3 gap-10  ">
            <div className="w-full h-full border border-yellow-500 rounded-xl bg-[#F8FAE5] p-8">
              <h3 className="text-4xl font-bold  text-start">بيع</h3>
              <p className="text-xl text-gray-700 mt-4 text-start">
                {" "}
                نوفر لك مجموعة من الأدوات تمكنك من النمو وبيع خبراتك بسهولة.
              </p>
            </div>

            <div className="w-full h-full border border-yellow-500 rounded-xl bg-[#F8FAE5] p-8">
              <h3 className="text-4xl font-bold  text-start">إدارة</h3>
              <p className="text-xl text-gray-700 mt-4 text-start">
                {" "}
                لوحة تحكم سهلة، بتجربة مذهلة، تتيح إدارة كل دوراتك.
              </p>
            </div>

            <div className="w-full h-full border border-yellow-500 rounded-xl bg-[#F8FAE5] p-8">
              <h3 className="text-4xl font-bold  text-start">تحليل</h3>
              <p className="text-xl text-gray-700 mt-4 text-start">
                {" "}
                تقارير وإحصاءات متقدمة تساعدك في الارتقاء بعملك.
              </p>
            </div>
          </div>
        </MaxWidthWrapper>
      </FadeIn>
      <FadeIn>
        <MaxWidthWrapper>
          <Pricing />
        </MaxWidthWrapper>
      </FadeIn>
      <StartNew />

      <SiteFooter />
    </>
  );
}
