import { Icons } from "../components/my-icons";

export const SIDE_BAR_ITEMS = [
  {
    title: "الرئيسية",
    slug: "/",
    icon: Icons.Home,
    subitems: [],
  },
  {
    title: "ادارة محتوى",
    slug: "/courses",
    icon: Icons.Academy,
    subitems: [
      {
        title: "الدورات التدريبية",
        icon: Icons.Home,
        slug: "/courses",
      },
      {
        title: "المنتجات الرقمية",
        icon: Icons.Home,
        slug: "/products",
      },
      // {
      //   title: "مكتبة الفيديو",
      //   icon: Icons.Home,
      //   slug: "/video-library",
      // },
    ],
  },
  {
    title: "المبيعات",
    slug: "/orders",
    icon: Icons.money,
    subitems: [],
  },

  {
    title: "تخصيص الأكاديمية",
    slug: "/cutomize",
    icon: Icons.customize,
    subitems: [
      {
        title: "منشئ الموقع",
        icon: Icons.Home,
        slug: "/theme-editor",
      },
      {
        title: "مصمم الشهادة",
        icon: Icons.Home,
        slug: "/products",
      },
    ],
  },

  {
    title: "التسويق",
    slug: "/marketing",
    icon: () => (
      <svg
        width="16"
        height="16"
        viewBox="0 0 25 24"
        fill="none"
        xmlns="http://www.w3.org/2000/svg"
      >
        <path
          d="M10.5331 16.5555C9.69456 16.4824 8.84382 16.4458 7.98577 16.4458H7.07164C5.617 16.4458 4.22194 15.868 3.19335 14.8394C2.16477 13.8108 1.58691 12.4157 1.58691 10.9611C1.58691 9.50646 2.16477 8.1114 3.19335 7.08281C4.22194 6.05422 5.617 5.47637 7.07164 5.47637H7.98577C8.84382 5.47637 9.69456 5.43981 10.5331 5.36668M10.5331 16.5555C10.8415 17.728 11.2449 18.8616 11.7337 19.9475C12.0347 20.6179 11.8068 21.4223 11.1693 21.7892L10.3686 22.2523C9.697 22.6399 8.83285 22.3949 8.50743 21.6905C7.73504 20.0195 7.14655 18.2695 6.75231 16.4714M10.5331 16.5555C10.0541 14.7294 9.8124 12.8491 9.81401 10.9611C9.81401 9.02804 10.0639 7.15348 10.5331 5.36668M10.5331 16.5555C14.289 16.8774 17.9463 17.9268 21.3015 19.6453M10.5331 5.36668C14.289 5.04481 17.9463 3.99541 21.3015 2.27694M21.3015 19.6453C21.1577 20.1084 21.0029 20.5643 20.8383 21.0164M21.3015 19.6453C21.9645 17.5081 22.3792 15.3017 22.5374 13.0697M21.3015 2.27694C21.1585 1.81609 21.0041 1.35889 20.8383 0.905762M21.3015 2.27694C21.9645 4.41409 22.3792 6.62049 22.5374 8.85253M22.5374 8.85253C23.1407 9.3559 23.5258 10.114 23.5258 10.9611C23.5258 11.8082 23.1407 12.5663 22.5374 13.0697M22.5374 8.85253C22.6374 10.2565 22.6374 11.6657 22.5374 13.0697"
          stroke="white"
          stroke-width="1.5"
          stroke-linecap="round"
          stroke-linejoin="round"
        />
      </svg>
    ),
    subitems: [
      {
        title: "صانع القسائم",
        icon: Icons.Home,
        slug: "/marketing/coupons",
      },
    ],
  },

  {
    title: "تجربة الطلاب",
    slug: "/students",
    icon: () => (
      <svg
        width="16"
        height="15"
        viewBox="0 0 26 24"
        fill="none"
        xmlns="http://www.w3.org/2000/svg"
      >
        <path
          d="M16.4518 20.1966C17.472 20.4928 18.5292 20.6427 19.5916 20.6416C21.3001 20.644 22.9864 20.2545 24.5208 19.5029C24.5661 18.4308 24.2607 17.3732 23.6509 16.4903C23.0411 15.6074 22.1601 14.9473 21.1414 14.6102C20.1227 14.2731 19.0219 14.2772 18.0057 14.622C16.9896 14.9668 16.1136 15.6335 15.5105 16.521M16.4518 20.1966V20.193C16.4518 18.8618 16.1097 17.6094 15.5105 16.521M16.4518 20.1966V20.3234C14.1499 21.7098 11.5126 22.4403 8.8254 22.4357C6.03726 22.4357 3.42855 21.6643 1.20139 20.3234L1.2002 20.193C1.19928 18.4999 1.76191 16.8546 2.79937 15.5166C3.83684 14.1785 5.29014 13.2238 6.93015 12.803C8.57015 12.3822 10.3036 12.5191 11.8571 13.1923C13.4107 13.8655 14.696 15.0366 15.5105 16.521M12.8635 4.94263C12.8635 6.01328 12.4382 7.04007 11.6811 7.79713C10.924 8.55419 9.89724 8.9795 8.82659 8.9795C7.75595 8.9795 6.72915 8.55419 5.97209 7.79713C5.21503 7.04007 4.78972 6.01328 4.78972 4.94263C4.78972 3.87199 5.21503 2.84519 5.97209 2.08813C6.72915 1.33107 7.75595 0.905762 8.82659 0.905762C9.89724 0.905762 10.924 1.33107 11.6811 2.08813C12.4382 2.84519 12.8635 3.87199 12.8635 4.94263ZM22.7314 7.63388C22.7314 8.4666 22.4006 9.26522 21.8118 9.85405C21.2229 10.4429 20.4243 10.7737 19.5916 10.7737C18.7589 10.7737 17.9602 10.4429 17.3714 9.85405C16.7826 9.26522 16.4518 8.4666 16.4518 7.63388C16.4518 6.80116 16.7826 6.00254 17.3714 5.41371C17.9602 4.82489 18.7589 4.49409 19.5916 4.49409C20.4243 4.49409 21.2229 4.82489 21.8118 5.41371C22.4006 6.00254 22.7314 6.80116 22.7314 7.63388Z"
          stroke="white"
          stroke-width="1.5"
          stroke-linecap="round"
          stroke-linejoin="round"
        />
      </svg>
    ),
    subitems: [
      {
        title: "الطلاب",
        icon: Icons.Home,
        slug: "/students",
      },
      {
        title: "الشهدات",
        icon: Icons.Home,
        slug: "/students/certificates",
      },

      // {
      //   title: "التعليقات ",
      //   icon: Icons.Home,
      //   slug: "/students/comments",
      // },
      // {
      //   title: "الواجبات",
      //   icon: Icons.Home,
      //   slug: "/students/homeworks",
      // },
      // {
      //   title: "الاختبارات ",
      //   icon: Icons.Home,
      //   slug: "/students/exams",
      // },
      // {
      //   title: "الاشعارات",
      //   icon: Icons.Home,
      //   slug: "/students/notifications",
      // },
    ],
  },

  // {
  //   title: "التحليلات",
  //   slug: "/analytics",
  //   icon: Icons.customize,
  //   subitems: [
  //     {
  //       title: "المنتجات",
  //       icon: Icons.Home,
  //       slug: "/analytics/products",
  //     },
  //     {
  //       title: "الارباح",
  //       icon: Icons.Home,
  //       slug: "/analytics/profits",
  //     },
  //     {
  //       title: "العملاء",
  //       icon: Icons.Home,
  //       slug: "/analytics/customers",
  //     },
  //   ],
  // },

  {
    title: "الإعدادات",
    icon: Icons.settings,
    subitems: [
      // {
      //   title: "إعدادات الاكاديمية",
      //   icon: Icons.Home,
      //   slug: "/settings",
      // },
      {
        title: "وسائل الدفع",
        icon: Icons.Home,
        slug: "/settings/payments-methods",
      },
      {
        title: "إعدادات الموقع",
        icon: Icons.Home,
        slug: "/settings/website-settings",
      },
      {
        title: "باقة الأكاديمية",
        icon: Icons.Home,
        slug: "/pricing",
      },
    ],
    slug: "/settings",
  },
];
