export const hero = {
  title: "",
};

export const what_to_do = [
  {
    title: "إنشاء آكاديمية",
    description:
      "حوّل معرفتك وخبرتك إلى عمل ناجح عبر الإنترنت بسهولة وتجربة عربية استثنائية.",
    icon_url: "/store.svg",
  },
  {
    title: "رفع دورات وفيديوهات تعليمية",
    description:
      "حوّل معرفتك وخبرتك إلى عمل ناجح عبر الإنترنت بسهولة وتجربة عربية استثنائية.",
    icon_url: "/upload.svg",
  },
  {
    title: "بيع دورات وتحقيق آرباح",
    description:
      "حوّل معرفتك وخبرتك إلى عمل ناجح عبر الإنترنت بسهولة وتجربة عربية استثنائية.",
    icon_url: "/money.svg",
  },
  {
    title: "تعزيز تجربة طلابك",
    description:
      "حوّل معرفتك وخبرتك إلى عمل ناجح عبر الإنترنت بسهولة وتجربة عربية استثنائية.",
    icon_url: "/peapol.svg",
  },
];
