export const PLANS = [
  {
    plan: "الباقة الآساسية",
    price: "1999",
    tagline:
      "إنشاء منصتك التعليمية ومنتجاتك الرقمية وبيعها وتسويقها عبر الإنترنت.",
    quota: 10,

    features: [
      {
        text: "3 دورات تدريبية",
      },
      {
        text: "عدد طلاب غير محدود",
      },
      {
        text: "3 منتجات رقمية",
      },
      {
        text: "اختبارات وواجبات",
      },
      {
        text: "تخصيص تصميم شهادة واحدة",
      },

      {
        text: "بوابات دفع الكتروني",
      },
      {
        text: "إزالة هوية جدارة",
        negative: true,
      },
    ],
  },

  {
    plan: "باقة النمو",
    price: "3500",
    tagline:
      "ارتقِ بمستوى عملك من خلال ميزات تساعدك على تحقيق نمو فائق السرعة.",
    quota: 10,

    features: [
      {
        text: "10 دورات تدريبية",
      },
      {
        text: "عدد طلاب غير محدود",
      },
      {
        text: "10 منتجات رقمية",
      },
      {
        text: "اختبارات وواجبات",
      },
      {
        text: "تخصيص تصميم 3 شهادات",
      },

      {
        text: "بوابات دفع الكتروني",
      },
      {
        text: "إزالة هوية جدارة",
        negative: true,
      },
    ],
  },

  {
    plan: "الباقة الاحترافية",
    price: "5500",
    tagline: "سعة غير محدودة وأدوات متقدمة تساعدك على التوسّع بعملك ومنتجاتك.",
    quota: 10,

    features: [
      {
        text: "عدد دورات غير محدود",
      },
      {
        text: "عدد طلاب غير محدود",
      },
      {
        text: "منتجات رقمية غير محدودة",
      },
      {
        text: "اختبارات وواجبات",
      },
      {
        text: "تخصيص تصميم 10 شهادات",
      },

      {
        text: "بوابات دفع الكتروني",
      },
      {
        text: "إزالة هوية جدارة",
      },
    ],
  },
] as const;
